@donaldgray Here’s the plan for the latest version of the branch:

<details>
<summary>output from <code>terraform plan -no-color</code></summary>

```
aws_iam_role.edge_lambda_role: Refreshing state... [id=edge_lambda20210115145807645600000001]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:760097843905:certificate/1a749ce8-ebd3-4342-accb-37f692fc8e52]
aws_iam_role_policy_attachment.basic_execution_role: Refreshing state... [id=edge_lambda20210115145807645600000001-20210118123134169600000001]
aws_lambda_function.dlcs_path_rewrite: Refreshing state... [id=cf_edge_dlcs_path_rewrite]
module.cert.aws_route53_record.cert_validation["iiif-test.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__abb9a4cf94db5c035d0b592c191a752c.iiif-test.wellcomecollection.org_CNAME]
module.cert.aws_route53_record.cert_validation["iiif-stage.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__f6230f795c1f08b9a0b762a8453ded6a.iiif-stage.wellcomecollection.org_CNAME]
module.cert.aws_route53_record.cert_validation["iiif.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__702dcdec0ef35b207c14c589bc694cef.iiif.wellcomecollection.org_CNAME]
module.cert.aws_route53_record.cert_validation["iiif-prod.wellcomecollection.org"]: Refreshing state... [id=Z0902614YH73JBCZG1MA__3de1ea364841b165a8f0f84c91d6d3aa.iiif-prod.wellcomecollection.org_CNAME]
module.iiif-prod.aws_cloudfront_distribution.iiif: Refreshing state... [id=E1KKXGJWOADM2A]
module.iiif-test.aws_cloudfront_distribution.iiif: Refreshing state... [id=E2RTRZI6TQCGOR]
module.iiif-stage.aws_cloudfront_distribution.iiif: Refreshing state... [id=E1ADWCLNPHV609]
module.cert.aws_acm_certificate_validation.validation: Refreshing state... [id=2022-05-26 02:09:42.312 +0000 UTC]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.dlcs_path_rewrite has changed
  ~ resource "aws_lambda_function" "dlcs_path_rewrite" {
        id                             = "cf_edge_dlcs_path_rewrite"
      ~ last_modified                  = "2021-04-09T11:38:09.689+0000" -> "2023-01-10T11:27:07.000+0000"
      ~ source_code_hash               = "LrteQZgQBm16cz6ZwIujiOC421YUZx7QrYpDXgYpZsU=" -> "6ipLhaYh2BhXs/5juasZ0RnMHko9i1/BOKsxW2xg0DI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.dlcs_path_rewrite will be updated in-place
  ~ resource "aws_lambda_function" "dlcs_path_rewrite" {
        id                             = "cf_edge_dlcs_path_rewrite"
      ~ last_modified                  = "2023-01-10T11:27:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> (known after apply)
      ~ s3_object_version              = "T3BFZrowzs9JJyX3kyPcJyTBWiWms5P5" -> "oZZYyMwCS13Utgt8gckyEHd_wlsqJweY"
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cert_stagenew.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "iiif-stage-new.wellcomecollection.org"
      + domain_validation_options = [
          + {
              + domain_name           = "iiif-stage-new.wellcomecollection.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.cert_stagenew.aws_acm_certificate_validation.validation will be created
  + resource "aws_acm_certificate_validation" "validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.cert_stagenew.aws_route53_record.cert_validation["iiif-stage-new.wellcomecollection.org"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z0902614YH73JBCZG1MA"
    }

  # module.iiif-stage.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E1ADWCLNPHV609"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)


      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }



        # (18 unchanged blocks hidden)
    }

  # module.iiif-stage-new.aws_cloudfront_distribution.iiif will be created
  + resource "aws_cloudfront_distribution" "iiif" {
      + aliases                        = [
          + "iiif-stage-new.wellcomecollection.org",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "IIIF APIs (stage-new)"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Managed" = "terraform"
        }
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "iiif"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Origin",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/A00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/B00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/L00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/M00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/N00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/S00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/V00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "image/W00*"
          + target_origin_id       = "dlcs_wellcome_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 604800
          + path_pattern           = "image/*"
          + target_origin_id       = "dlcs_images"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/A00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/B00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/L00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/M00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/N00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/S00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/V00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/W00*"
          + target_origin_id       = "dlcs_wellcome_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumb/*"
          + target_origin_id       = "iiif"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "*",
                ]
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "thumbs/*"
          + target_origin_id       = "dlcs_thumbs"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "av/*"
          + target_origin_id       = "dlcs_av"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "pdf/*"
          + target_origin_id       = "dlcs_pdf"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "file/*"
          + target_origin_id       = "dlcs_file"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "auth/*"
          + target_origin_id       = "dlcs_auth"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Authorization",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }

          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "dash/*"
          + target_origin_id       = "dashboard"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "*",
                ]
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "pdf-cover/*"
          + target_origin_id       = "pdf_cover"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_auth"
          + origin_path = "/auth/2"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_av"
          + origin_path = "/iiif-av/wellcome/6"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_images"
          + origin_path = "/iiif-img/wellcome/6"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_thumbs"
          + origin_path = "/thumbs/wellcome/6"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_wellcome_images"
          + origin_path = "/iiif-img/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_wellcome_thumbs"
          + origin_path = "/thumbs/wellcome/8"

          + custom_header {
              + name  = "X-Forwarded-Host"
              + value = "iiif-stage-new.wellcomecollection.org"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dash-stage-new.wellcomecollection.digirati.io"
          + origin_id   = "dashboard"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "dds-stage-new.wellcomecollection.digirati.io"
          + origin_id   = "iiif"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_file"
          + origin_path = "/file/wellcome/6"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "neworchestrator.dlcs.io"
          + origin_id   = "dlcs_pdf"
          + origin_path = "/pdf/wellcome/pdf/6"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + domain_name = "pdf-stage-new.wellcomecollection.digirati.io"
          + origin_id   = "pdf_cover"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.iiif-test.aws_cloudfront_distribution.iiif will be updated in-place
  ~ resource "aws_cloudfront_distribution" "iiif" {
        id                             = "E2RTRZI6TQCGOR"
        tags                           = {
            "Managed" = "terraform"
        }
        # (17 unchanged attributes hidden)


      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }



        # (18 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ dlcs_path_rewrite_arn_latest   = "arn:aws:lambda:us-east-1:760097843905:function:cf_edge_dlcs_path_rewrite:23" -> (known after apply)
  + iiif_stage_new_distribution_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"
```

</details>

Crucially, it’s no longer trying to modify the prod distribution.

I can apply this first thing tomorrow if this looks correct to you.